Config/DataProcessors/ОбработкаДанныхОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаДанныхОтчетности</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/ПравилаЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаЗаполнения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеСНастройками</Name>
					<Comment>При заполнении отчета всегда выводится форма настроек заполнения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяОбработкаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетодОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнятьПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьВМенюЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВИнтерфейсе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменяетсяВНастройкеЗаполнения</Name>
							<Comment>Если Истина, отображается в форме "Настройка заполнения" и "Заполнение по документу основанию"</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезПодтверждения</Name>
							<Comment>Если "ОтображатьВМенюЗаполнения" = Истина, то при нажатии на команду в отчете, если "БезПодтверждения" = Истина, не будет открываться окно настроек.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПодсказки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КартыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТаблицаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбщиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательскаяДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадаетсяСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ОбработкаДанныхОтчетности/Forms/ЗаполнитьНастройкиКартДанныхДляСчетовПоКоду/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данный метод нельзя выполнять из формы документа.'"));
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	// Заполнение списков выбора
	СоответствиеКолонок = Новый Соответствие;
	
	ТипСчет = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаКарт = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	Для каждого СтрокаТаблицы Из ТаблицаКарт Цикл
		
		Представление = СтрокаТаблицы.Ключ;
		
		ТаблицаДанных = СтрокаТаблицы.Значение;
		
		СписокКолонокСчет = Новый СписокЗначений;
		СписокКолонокСтрока = Новый СписокЗначений;
		
		Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
			
			Для каждого КолонкаТаблицы Из ТаблицаДанных.Колонки Цикл
				
				Если КолонкаТаблицы.ТипЗначения = ТипСчет Тогда
					
					СписокКолонокСчет.Добавить(КолонкаТаблицы.Имя);
					
				ИначеЕсли КолонкаТаблицы.ТипЗначения = ТипСтрока Тогда
					
					СписокКолонокСтрока.Добавить(КолонкаТаблицы.Имя);	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если СписокКолонокСчет.Количество() <> 0
			И СписокКолонокСтрока.Количество() <> 0 Тогда
			
			СоответствиеКолонок.Вставить(Представление+"__Счет", СписокКолонокСчет);
			СоответствиеКолонок.Вставить(Представление+"__Строка", СписокКолонокСтрока);
			Элементы.ТаблицаКартДанныхКартаДанных.СписокВыбора.Добавить(Представление);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураКартДанных = Новый ФиксированноеСоответствие(СоответствиеКолонок);
	
	// Заполнение значений параметров
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыМетода) Тогда
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("ТаблицаКартДанных",ЗначениеПараметра) Тогда
			Для каждого СтрокаТаблицы Из ЗначениеПараметра Цикл
				НоваяСтрока = ТаблицаКартДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТаблицы Из ТаблицаКартДанных Цикл
		
		ИндексСтроки = ТаблицаКартДанных.Индекс(СтрокаТаблицы);
		Если ПустаяСтрока(СтрокаТаблицы.КартаДанных) Тогда
			
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение не задано'"), , "ТаблицаКартДанных["+ИндексСтроки+"].КартаДанных");
			
		КонецЕсли;
		
		Если ПустаяСтрока(СтрокаТаблицы.КолонкаСчет) Тогда
			
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение не задано'"), , "ТаблицаКартДанных["+ИндексСтроки+"].КолонкаСчет");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТаблицаКартДанных

&НаКлиенте
Процедура ТаблицаКартДанныхКартаДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных = ВыбранноеЗначение;
	
	ТипСчет = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	
		СписокКолонокСчет = СтруктураКартДанных.Получить(Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных+"__Счет");
	
	ДоступнаяКолонка = СписокКолонокСчет.НайтиПоЗначению(Элементы.ТаблицаКартДанных.ТекущиеДанные.КолонкаСчетСсылка);
	Если ДоступнаяКолонка = Неопределено Тогда
		
		Колонка = Неопределено;
		Если СписокКолонокСчет.Количество() = 1 Тогда
			
			Колонка = СписокКолонокСчет[0].Значение;
			
		КонецЕсли;
		
		Элементы.ТаблицаКартДанных.ТекущиеДанные.КолонкаСчетСсылка = Колонка;
		
	КонецЕсли;
	
	СписокКолонокСчетКод = СтруктураКартДанных.Получить(Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных+"__Строка");
	ДоступнаяКолонка = СписокКолонокСчетКод.НайтиПоЗначению(Элементы.ТаблицаКартДанных.ТекущиеДанные.КолонкаСчет);
	Если ДоступнаяКолонка = Неопределено Тогда
		
		Колонка = Неопределено;
		Если СписокКолонокСчетКод.Количество() = 1 Тогда
			
			Колонка = СписокКолонокСчетКод[0].Значение;
			
		КонецЕсли;
		
		Элементы.ТаблицаКартДанных.ТекущиеДанные.КолонкаСчет = Колонка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКартДанныхКолонкаСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СписокКолонок = СтруктураКартДанных.Получить(Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных+"__Строка");
	Если СписокКолонок <> Неопределено Тогда
		Для каждого ЭлементСписка Из СписокКолонок Цикл
			ДанныеВыбора.Добавить(ЭлементСписка.Значение);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКартДанныхКолонкаСчетСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СписокКолонок = СтруктураКартДанных.Получить(Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных+"__Счет");
	Если СписокКолонок <> Неопределено Тогда
		Для каждого ЭлементСписка Из СписокКолонок Цикл
			ДанныеВыбора.Добавить(ЭлементСписка.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если СтруктураВозврата <> Неопределено Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт
	
	Возврат СохранитьПараметры(); 
	
КонецФункции


&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		ТЗ = РеквизитФормыВЗначение("ТаблицаКартДанных");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТаблицаКартДанных", ТЗ);
		
		ПредставлениеПараметров();
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров()
	
	ПредставлениеПараметров = "Карты данных: (";
	
	ДобавлятьЗапятую = Ложь;
	Для каждого СтрокаТаблицы Из ТаблицаКартДанных Цикл
		
		ПредставлениеПараметров = ПредставлениеПараметров + ?(ДобавлятьЗапятую, ",", "") + СтрокаТаблицы.КартаДанных;
		ДобавлятьЗапятую = Истина;
		
	КонецЦикла;
	
	ПредставлениеПараметров = ПредставлениеПараметров + ")";
	
КонецПроцедуры
